blog/2015/06/04/进程间通讯/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>进程间通讯 - 暗无天日</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  <meta name="author" content="DarkSun" />
  <link rel="stylesheet" media="screen" href="../../../../../media/css/font.css" rel="stylesheet" type="text/css"/>
  <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css">
  <link rel="stylesheet" href="../../../../../media/css/org-src-fontify.css" type="text/css">
  <link rel="stylesheet" href="../../../../../media/css/kdComment.css" type="text/css">
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">暗无天日</a></h1>
    <p>=============&gt;DarkSun的个人博客</p>
    <nav class="site-nav">
      <div class="menu-icon">
      </div>
      <ul class="trigger">
              <li><a href="../../../../../years/">Years</a></li>
              <li><a href="../../../../../tags/">Tags</a></li>
              <li><a href="../../../../../about/">About</a></li>
              <li><a href="https://github.com/lujun9972/lujun9972.github.com.git">Github</a></li>
              <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
        <input type="text" class="field" name="q" id="s" placeholder="Search">
        <input type="hidden" name="as_sitesearch" value="lujun9972.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">进程间通讯</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb2e76fd">1. 管道</a>
<ul>
<li><a href="#orgd748b14">1.1. 管道的局限性</a></li>
<li><a href="#orgb82cc30">1.2. pipe函数创建管道</a></li>
<li><a href="#orgc7493ac">1.3. 对管道的读写说明</a></li>
<li><a href="#orgc3a8494">1.4. popen/pclose函数</a></li>
<li><a href="#org2ac757b">1.5. 使用管道时的注意事项</a></li>
</ul>
</li>
<li><a href="#org1d93ffa">2. FIFO</a>
<ul>
<li><a href="#orga578a86">2.1. FIFO的局限性</a></li>
<li><a href="#orgdc9f134">2.2. 创建FIFO</a></li>
<li><a href="#orgf19d17e">2.3. 使用FIFO</a></li>
<li><a href="#org8f2cfc1">2.4. 对FIFO的读写说明</a></li>
</ul>
</li>
<li><a href="#orged99a3d">3. XSI IPC</a>
<ul>
<li><a href="#orgde17b18">3.1. 共同特征</a>
<ul>
<li><a href="#org25be1ff">3.1.1. 标识符和键</a></li>
<li><a href="#orga3825e8">3.1.2. 权限结构</a></li>
<li><a href="#orgcfa8bbc">3.1.3. XSI IPC的优缺点:</a></li>
</ul>
</li>
<li><a href="#orgaba2911">3.2. 消息队列(<b>不推荐使用</b>)</a>
<ul>
<li><a href="#orgafbde54">3.2.1. 打开/创建新消息队列</a></li>
<li><a href="#org0d4c10e">3.2.2. 操作消息队列</a></li>
<li><a href="#org67332a6">3.2.3. 收发消息</a></li>
</ul>
</li>
<li><a href="#orgd28bb7c">3.3. 信号量集合</a>
<ul>
<li><a href="#org236f5f2">3.3.1. 新建/获取信号量集合</a></li>
<li><a href="#org2c07784">3.3.2. 操作信号量</a></li>
</ul>
</li>
<li><a href="#org2c7437f">3.4. 共享存储器</a>
<ul>
<li><a href="#org7d89eb4">3.4.1. 创建/获取共享存储</a></li>
<li><a href="#org3e524da">3.4.2. 操作共享存储段</a></li>
<li><a href="#org99b90a4">3.4.3. 使用共享内存</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgaa10e55">4. </a></li>
</ul>
</div>
</div>


<div id="outline-container-orgb2e76fd" class="outline-2">
<h2 id="orgb2e76fd"><span class="section-number-2">1</span> 管道</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd748b14" class="outline-3">
<h3 id="orgd748b14"><span class="section-number-3">1.1</span> 管道的局限性</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>管道只能保证是半双工的(即数据只能在一个方向流动),虽然有些系统提供了全双工管道</li>
<li>管道只能在具有公共祖先的进程之间使用. 通常管道由父进程创建,以实现父子进程之间的通讯</li>
</ul>
</div>
</div>

<div id="outline-container-orgb82cc30" class="outline-3">
<h3 id="orgb82cc30"><span class="section-number-3">1.2</span> pipe函数创建管道</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;unistd.h&gt;</span>

<span class="org-comment-delimiter">/*  </span><span class="org-comment">&#25104;&#21151;&#36820;&#22238;0,&#20986;&#38169;&#36820;&#22238;-1</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">int</span> <span class="org-function-name">pipe</span>(<span class="org-type">int</span>* <span class="org-variable-name">fd</span>);
</pre>
</div>
<p>
该函数通过参数fd返回两个文件描述符,其中fd[ 0 ]为读而打开,fd[ 1 ]为写而打开, <b>且fd[ 1 ]的输出为fd[ 0 ]的输入</b>
</p>

<p>
单进程中的管道几乎没有任何用处,因为进程内部的数据交换根本不需要通过管道来进行. 通常调用pipe的进程会接着fork一个子进程,并在父进程和子进程两端分别关闭读或写的文件描述符,通过这种方式就能实现父子进程间的通讯了.
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;unistd.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;fcntl.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/wait.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">int</span> <span class="org-variable-name">fd</span>[2];
  pipe(fd);

  <span class="org-type">pid_t</span> <span class="org-variable-name">pid</span> = fork();
  <span class="org-keyword">if</span>(pid &gt;0)                    <span class="org-comment-delimiter">/* </span><span class="org-comment">&#29238;&#36827;&#31243;</span><span class="org-comment-delimiter"> */</span>
    {
      printf(<span class="org-string">"parent running\n"</span>);
      fflush(stdout);
      close(fd[0]);             <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20851;&#38381;&#35835;fd,&#29238;&#36827;&#31243;&#36127;&#36131;&#21457;&#36865;&#28040;&#24687;</span><span class="org-comment-delimiter"> */</span>
      write(fd[1],<span class="org-string">"this is a messae from parent\n"</span>,255);
      close(fd[1]);
      waitpid(pid,<span class="org-constant">NULL</span>,0);
    }
  <span class="org-keyword">else</span>
    {
      printf(<span class="org-string">"child running\n"</span>);
      fflush(stdout);
      close(fd[1]);
      <span class="org-keyword">if</span>(dup2(fd[0],STDIN_FILENO) != STDIN_FILENO)
        {
          printf(<span class="org-string">"dup2 error\n"</span>);
          <span class="org-keyword">return</span> -1;
        }
      close(fd[0]);
      <span class="org-keyword">if</span>(execl(<span class="org-string">"/bin/echo_from_stdin.sh"</span>,<span class="org-string">"/bin/echo_from_stdin.sh"</span>,(<span class="org-type">char</span>*)0) &lt; 0)
        {
          printf(<span class="org-string">"exec echo failed\n"</span>);
        }
      <span class="org-comment-delimiter">/* </span><span class="org-comment">char s[255+1]="";</span><span class="org-comment-delimiter"> */</span>
      <span class="org-comment-delimiter">/* </span><span class="org-comment">printf("%s\n",gets(s));</span><span class="org-comment-delimiter"> */</span>
    }
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
child running
parent running
</p>

<p>
this is a messae from parent
</p>
</div>
</div>

<div id="outline-container-orgc7493ac" class="outline-3">
<h3 id="orgc7493ac"><span class="section-number-3">1.3</span> 对管道的读写说明</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>读取一个写端已关闭的管道时,在所有剩余数据被读取后,read返回0,</li>
<li>若写一个读端已关闭的管道时,则产生信号SIGPIPE. 若忽略该信号或捕捉该信号并从其处理函数返回,则write返回-1,errno设为EPIEP</li>
<li>写管道(或FIFO)时,常量PIPE_BUF规定了内核中管道缓冲区的大小. 若对管道调用write的字节&lt;=PIPE_BUF,则可以保证 <b>该操作不会与其他进程对同一管道或FIFO的write操作穿插到一起</b>. 否则写的数据可能穿插.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc3a8494" class="outline-3">
<h3 id="orgc3a8494"><span class="section-number-3">1.4</span> popen/pclose函数</h3>
<div class="outline-text-3" id="text-1-4">
<p>
这两个函数用于进程用system运行外部命令,并创建管道与该外部命令子进程进行交流
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#33509;type&#20026;"r",&#21017;&#36820;&#22238;&#36830;&#25509;&#21040;cmd&#26631;&#20934;&#36755;&#20986;&#30340;FILE*</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">&#33509;type&#20026;"w",&#21017;&#36820;&#22238;&#36830;&#25509;&#21040;cmd&#26631;&#20934;&#36755;&#20837;&#30340;FILE*</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">FILE</span>* <span class="org-function-name">popen</span>(<span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">cmd</span>,<span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">type</span>);

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#20851;&#38381;&#26631;&#20934;IO&#30041;,&#31561;&#24453;popen&#20013;cmd&#36816;&#34892;&#32467;&#26463;,&#20877;&#36820;&#22238;&#20854;&#32456;&#27490;&#29366;&#24577;,&#20986;&#38169;&#21017;&#36820;&#22238;-1</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">int</span> <span class="org-function-name">pclose</span>(<span class="org-type">FILE</span>* <span class="org-variable-name">fp</span>);
</pre>
</div>
<ul class="org-ul">
<li><b>popen只能连接到子进程的标准输入或标准输出,而无法通过type="rw"实现同时连接输入和输出</b></li>
</ul>
<p>
上面pipe的例子可以改写为:
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;unistd.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;fcntl.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/wait.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">FILE</span>* <span class="org-variable-name">fp</span> = popen(<span class="org-string">"/bin/echo_from_stdin.sh"</span>,<span class="org-string">"w"</span>);
  fputs(<span class="org-string">"message from parent\n"</span>,fp);
  pclose(fp);
  <span class="org-keyword">return</span> 0;
}

</pre>
</div>

<pre class="example">
message from parent

</pre>
</div>
</div>

<div id="outline-container-org2ac757b" class="outline-3">
<h3 id="org2ac757b"><span class="section-number-3">1.5</span> 使用管道时的注意事项</h3>
<div class="outline-text-3" id="text-1-5">
<p>
当用标准IO读写管道时,一定要注意 <b>标准IO的缓冲机制</b>. 缓冲很容易造成读写管道时的阻塞,甚至引起死锁.为此经常要用`setvbuf'函数更改缓冲类型.
</p>

<p>
当有多个进程同时对一个管道进行写操作时, <b>若一次写入的字节数大于PIPE_BUF,则可能会乱序写入</b>.
</p>
</div>
</div>
</div>
<div id="outline-container-org1d93ffa" class="outline-2">
<h2 id="org1d93ffa"><span class="section-number-2">2</span> FIFO</h2>
<div class="outline-text-2" id="text-2">
<p>
FIFO又叫命名管道,它与pipe的不同在于:pipe只能由共同祖先进程创建,然后通过fork函数在多个子进程之间使用. 而通过FIFO,无共同祖先进程的进程也能交换数据.
</p>

<p>
FIFO也是一种文件类型,stat结构中的st_mode可以标明文件是否为FIFO类型. 可以用S_ISFIFO宏对此进行测试.
</p>
</div>
<div id="outline-container-orga578a86" class="outline-3">
<h3 id="orga578a86"><span class="section-number-3">2.1</span> FIFO的局限性</h3>
<div class="outline-text-3" id="text-2-1">
<p>
FIFO只能保证是半双工的.
</p>
</div>
</div>

<div id="outline-container-orgdc9f134" class="outline-3">
<h3 id="orgdc9f134"><span class="section-number-3">2.2</span> 创建FIFO</h3>
<div class="outline-text-3" id="text-2-2">
<p>
创建FIFO的类似于创建文件.
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/stat.h&gt;</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">mode&#21442;&#25968;&#35828;&#26126;&#19982;open&#20989;&#25968;&#30456;&#21516;</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">int</span> <span class="org-function-name">mkfifo</span>(<span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">fifo_path</span>,<span class="org-type">mode_t</span> <span class="org-variable-name">mode</span>);
</pre>
</div>
</div>
</div>
