APUE/进程间通讯.org
** 使用FIFO
一旦用mkfifo创建了fifo,就可以使用open,close,read,write,unlink对其像处理文件一样使用FIFO.

但使用open打开FIFO时,非阻塞标志(O_NONBLOCK)的意义有点不同:
+ 若打开FIFO时未指定非阻塞标志,则只读open会阻塞到其他进程为写而打开次FIFO. 类似的,只写open会阻塞到其他进程为读而打开它.
+ 若打开FIFO时指定了非阻塞表示,则 *只读open立即返回*,但若 *没有进程已经为读而打开FIFO,只写open会立即返回-1,errno为ENXIO*.

** 对FIFO的读写说明
+ 若用write写一个尚无进程为读而打开的FIFO,则产生信号SIGPIPE
+ 若某个FIFO的最后一个写进程关闭了该FIFO,则读取该FIFO会生产一个eof
+ 类似pipe,常量PIPE_BUF说明了可被原子地写到FIFO的最大数据量.

* XSI IPC
XSI IPC包括三种IPC:信息队列,信号量,共享存储器. 它们之间有许多相似之处.
** 共同特征
*** 标识符和键
每种XSI IPC结构中都有一个非负整数作为标识符. 但该标识符仅为IPC对象内部使用,其对外与一个键(key)相连.

创建IPC结构时都需要指定一个键(key_t),该键由内核变换为IPC结构的标识符.

多个进程共享同一个IPC结构一般有如下几种方法:
+ 某进程指定键为IPC_PRIVATE以创建一个新IPC结构,并将返回的标识符存放在数据库或文件中,以便其他进程取用.
+ 定义一个多个进程间都认可的键,然后进程使用该键来生成或获取IPC结构.
+ 通过函数`ftok'可以指定一个路径和一个id,并根据这个路径及id生成一个键值,多个进程间约定同一个路径和id以产生一个一致的IPC键,共享IPC结构.
  #+BEGIN_SRC C
    #include <sys/ipc.h>

    key_t fork(const char* path,int id);
  #+END_SRC
  - 参数path必须是一个已存在的文件.

  - 产生键时,只使用 *id参数的低8位*

  - *如果参数id一致,即使不同的path参数也可能产生相同的键*
*** 权限结构
XSI IPC为每个IPC结构都设置了一个ipc_perm结构, 该结构规定了权限和所有者. 它至少包括下列成员:
#+BEGIN_SRC C
  #include <sys/ipc.h>

  struct ipc_perm{
    uid_t uid;                    /* 所有者的有效用户id */
    gid_t gid;                    /* 所有者的有效组id */
    uid_t cuid;                   /* 创建者的有效用户id */
    git_t cgid;                   /* 创建者的有效组id */
    mode_t mode;                  /* access mode */
    /* 其他成员 */
  };
#+END_SRC
+ mode成员类似文件的mode,但不存在执行权限.
*** XSI IPC的优缺点:
IPC的缺点有:
+ IPC结构是系统范围内都可访问,且即使读写的进程终止,消息与队列依然存在
+ IPC没有被抽象为一个文件,因此无法用IO函数操作它,也因此新增了十几条系统调用(msgget,semop,shmat等)
+ 由于IPC不使用文件描述符,因此无法对他们使用多路转接IO函数(select和poll). 这就难于一次使用多个IPC结构,以及在文件或设备IO中使用IPC结构.

IPC的优点有:
+ 可靠,因为这些IPC被限制在只能单机使用
+ 流是受控的,即当系统资源短缺(缓冲区满了),或接收进程能再接收更多消息,则发送进程会休眠. 当流控制条件消失,发送进程自动被唤醒
+ 面向记录
+ 可以用非先进先出方式处理.
** 消息队列(*不推荐使用*)
消息队列是消息的链接表,该链接表存放在内核中并由消息队列标识符标识.
*** 打开/创建新消息队列
msgget用于创建一个新队列或打开一个现存的队列.
#+BEGIN_SRC C
  #include <sys/msg.h>

  /* 成功则返回消息队列的ID,出错则返回-1 */
  int msgget(key_t key,int flag);
#+END_SRC

每个消息队列都有一个msgid_ds结构体与之关联,用于说明队列的当前状态
#+BEGIN_SRC C
  struct msqid_ds{
    struct ipc_perm msg_perm;     /* ipc的权限说明 */
    msgqnum_t msg_qnum;           /* 队列中的消息个数 */
    msglen_t msg_qbytes;          /* 队列中能存储的消息最大容量 */
    pid_t msg_lspid;              /* 最后一次在该队列上调用msgsnd()的进程id */
    pid_t msg_lrpid;              /* 最后一次在该队列上调用msgrcv()的进程id */
    time_t msg_stime;             /* 最后一次在该队列上调用msgsnd()的时间 */
    time_t msg_rtime;             /* 最后一次在该队列上调用msgrcv()的时间 */
    time_t msg_ctime;             /* 最后一次在该队列发生变化的事件 */
    /* 其他结构成员 */
  }
#+END_SRC

*** 操作消息队列
msgctl函数对消息队列执行队中操作
#+BEGIN_SRC C
  #include <sys/msg.h>

  int msgctl(int queueid,int cmd,struct msgid_ds* buf);
#+END_SRC
其中cmd参数说明了对queueid指定的队列要执行的命令:
+ IPC_SET

  按buf结构中的值,设置与消息队列msqid_ds结构中的下列四个字段:

  - msg_perm.uid

  - msg_perm.gid

  - msg_perm.mode

  - msg_qbytes

  执行该命令的进程,其有效用户ID必须等于msg_perm.cuid或msg_perm.uid或超级用户.

  只有超级用户才能增加msg_qbyes的值

+ IPC_RMID

  删除消息队列中的所有消息.

  执行该命令的进程,其有效用户ID必须等于msg_perm.cuid或msg_perm.uid或超级用户.

+ IPC_STAT 

  取此消息队列的msgid_ds结构,并放在buf所指向的结构中
  #+BEGIN_SRC C :exports both :results drawer
    #include <sys/msg.h>
    #include <sys/ipc.h>

    void show_queue_ds(const struct msqid_ds* queue_ds)
    {
      printf("msg_qnum=%d\n",queue_ds->msg_qnum);
      printf("msg_qbytes=%d\n",queue_ds->msg_qbytes);
      printf("msg_lspid=%d\n",queue_ds->msg_lspid);
      printf("msg_lrpid=%d\n",queue_ds->msg_lrpid);

    }
    int main(int argc, char *argv[])
    {
      int queueid = msgget(IPC_PRIVATE,IPC_CREAT);
      struct msqid_ds queue_ds;
      msgctl(queueid,IPC_STAT,&queue_ds);
      show_queue_ds(&queue_ds);
      return 0;
    }

  #+END_SRC

  #+RESULTS:
  :RESULTS:
  msg_qnum=1630404681
  msg_qbytes=1627419888
  msg_lspid=1628099819
  msg_lrpid=192
  :END:

