blog/2015/06/04/进程间通讯/index.html

<div id="outline-container-orgf19d17e" class="outline-3">
<h3 id="orgf19d17e"><span class="section-number-3">2.3</span> 使用FIFO</h3>
<div class="outline-text-3" id="text-2-3">
<p>
一旦用mkfifo创建了fifo,就可以使用open,close,read,write,unlink对其像处理文件一样使用FIFO.
</p>

<p>
但使用open打开FIFO时,非阻塞标志(O_NONBLOCK)的意义有点不同:
</p>
<ul class="org-ul">
<li>若打开FIFO时未指定非阻塞标志,则只读open会阻塞到其他进程为写而打开次FIFO. 类似的,只写open会阻塞到其他进程为读而打开它.</li>
<li>若打开FIFO时指定了非阻塞表示,则 <b>只读open立即返回</b>,但若 <b>没有进程已经为读而打开FIFO,只写open会立即返回-1,errno为ENXIO</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org8f2cfc1" class="outline-3">
<h3 id="org8f2cfc1"><span class="section-number-3">2.4</span> 对FIFO的读写说明</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>若用write写一个尚无进程为读而打开的FIFO,则产生信号SIGPIPE</li>
<li>若某个FIFO的最后一个写进程关闭了该FIFO,则读取该FIFO会生产一个eof</li>
<li>类似pipe,常量PIPE_BUF说明了可被原子地写到FIFO的最大数据量.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orged99a3d" class="outline-2">
<h2 id="orged99a3d"><span class="section-number-2">3</span> XSI IPC</h2>
<div class="outline-text-2" id="text-3">
<p>
XSI IPC包括三种IPC:信息队列,信号量,共享存储器. 它们之间有许多相似之处.
</p>
</div>
<div id="outline-container-orgde17b18" class="outline-3">
<h3 id="orgde17b18"><span class="section-number-3">3.1</span> 共同特征</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org25be1ff" class="outline-4">
<h4 id="org25be1ff"><span class="section-number-4">3.1.1</span> 标识符和键</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
每种XSI IPC结构中都有一个非负整数作为标识符. 但该标识符仅为IPC对象内部使用,其对外与一个键(key)相连.
</p>

<p>
创建IPC结构时都需要指定一个键(key_t),该键由内核变换为IPC结构的标识符.
</p>

<p>
多个进程共享同一个IPC结构一般有如下几种方法:
</p>
<ul class="org-ul">
<li>某进程指定键为IPC_PRIVATE以创建一个新IPC结构,并将返回的标识符存放在数据库或文件中,以便其他进程取用.</li>
<li>定义一个多个进程间都认可的键,然后进程使用该键来生成或获取IPC结构.</li>
<li><p>
通过函数`ftok'可以指定一个路径和一个id,并根据这个路径及id生成一个键值,多个进程间约定同一个路径和id以产生一个一致的IPC键,共享IPC结构.
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/ipc.h&gt;</span>

<span class="org-type">key_t</span> <span class="org-function-name">fork</span>(<span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">path</span>,<span class="org-type">int</span> <span class="org-variable-name">id</span>);
</pre>
</div>
<ul class="org-ul">
<li>参数path必须是一个已存在的文件.</li>

<li>产生键时,只使用 <b>id参数的低8位</b></li>

<li><b>如果参数id一致,即使不同的path参数也可能产生相同的键</b></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga3825e8" class="outline-4">
<h4 id="orga3825e8"><span class="section-number-4">3.1.2</span> 权限结构</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
XSI IPC为每个IPC结构都设置了一个ipc_perm结构, 该结构规定了权限和所有者. 它至少包括下列成员:
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/ipc.h&gt;</span>

<span class="org-keyword">struct</span> <span class="org-type">ipc_perm</span>{
  <span class="org-type">uid_t</span> <span class="org-variable-name">uid</span>;                    <span class="org-comment-delimiter">/* </span><span class="org-comment">&#25152;&#26377;&#32773;&#30340;&#26377;&#25928;&#29992;&#25143;id</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">gid_t</span> <span class="org-variable-name">gid</span>;                    <span class="org-comment-delimiter">/* </span><span class="org-comment">&#25152;&#26377;&#32773;&#30340;&#26377;&#25928;&#32452;id</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">uid_t</span> <span class="org-variable-name">cuid</span>;                   <span class="org-comment-delimiter">/* </span><span class="org-comment">&#21019;&#24314;&#32773;&#30340;&#26377;&#25928;&#29992;&#25143;id</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">git_t</span> <span class="org-variable-name">cgid</span>;                   <span class="org-comment-delimiter">/* </span><span class="org-comment">&#21019;&#24314;&#32773;&#30340;&#26377;&#25928;&#32452;id</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">mode_t</span> <span class="org-variable-name">mode</span>;                  <span class="org-comment-delimiter">/* </span><span class="org-comment">access mode</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20854;&#20182;&#25104;&#21592;</span><span class="org-comment-delimiter"> */</span>
};
</pre>
</div>
<ul class="org-ul">
<li>mode成员类似文件的mode,但不存在执行权限.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcfa8bbc" class="outline-4">
<h4 id="orgcfa8bbc"><span class="section-number-4">3.1.3</span> XSI IPC的优缺点:</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
IPC的缺点有:
</p>
<ul class="org-ul">
<li>IPC结构是系统范围内都可访问,且即使读写的进程终止,消息与队列依然存在</li>
<li>IPC没有被抽象为一个文件,因此无法用IO函数操作它,也因此新增了十几条系统调用(msgget,semop,shmat等)</li>
<li>由于IPC不使用文件描述符,因此无法对他们使用多路转接IO函数(select和poll). 这就难于一次使用多个IPC结构,以及在文件或设备IO中使用IPC结构.</li>
</ul>

<p>
IPC的优点有:
</p>
<ul class="org-ul">
<li>可靠,因为这些IPC被限制在只能单机使用</li>
<li>流是受控的,即当系统资源短缺(缓冲区满了),或接收进程能再接收更多消息,则发送进程会休眠. 当流控制条件消失,发送进程自动被唤醒</li>
<li>面向记录</li>
<li>可以用非先进先出方式处理.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaba2911" class="outline-3">
<h3 id="orgaba2911"><span class="section-number-3">3.2</span> 消息队列(<b>不推荐使用</b>)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
消息队列是消息的链接表,该链接表存放在内核中并由消息队列标识符标识.
</p>
</div>
<div id="outline-container-orgafbde54" class="outline-4">
<h4 id="orgafbde54"><span class="section-number-4">3.2.1</span> 打开/创建新消息队列</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
msgget用于创建一个新队列或打开一个现存的队列.
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/msg.h&gt;</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#25104;&#21151;&#21017;&#36820;&#22238;&#28040;&#24687;&#38431;&#21015;&#30340;ID,&#20986;&#38169;&#21017;&#36820;&#22238;-1</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">int</span> <span class="org-function-name">msgget</span>(<span class="org-type">key_t</span> <span class="org-variable-name">key</span>,<span class="org-type">int</span> <span class="org-variable-name">flag</span>);
</pre>
</div>

<p>
每个消息队列都有一个msgid_ds结构体与之关联,用于说明队列的当前状态
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-keyword">struct</span> <span class="org-type">msqid_ds</span>{
  <span class="org-keyword">struct</span> <span class="org-type">ipc_perm</span> <span class="org-variable-name">msg_perm</span>;     <span class="org-comment-delimiter">/* </span><span class="org-comment">ipc&#30340;&#26435;&#38480;&#35828;&#26126;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">msgqnum_t</span> <span class="org-variable-name">msg_qnum</span>;           <span class="org-comment-delimiter">/* </span><span class="org-comment">&#38431;&#21015;&#20013;&#30340;&#28040;&#24687;&#20010;&#25968;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">msglen_t</span> <span class="org-variable-name">msg_qbytes</span>;          <span class="org-comment-delimiter">/* </span><span class="org-comment">&#38431;&#21015;&#20013;&#33021;&#23384;&#20648;&#30340;&#28040;&#24687;&#26368;&#22823;&#23481;&#37327;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">pid_t</span> <span class="org-variable-name">msg_lspid</span>;              <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#19968;&#27425;&#22312;&#35813;&#38431;&#21015;&#19978;&#35843;&#29992;msgsnd()&#30340;&#36827;&#31243;id</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">pid_t</span> <span class="org-variable-name">msg_lrpid</span>;              <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#19968;&#27425;&#22312;&#35813;&#38431;&#21015;&#19978;&#35843;&#29992;msgrcv()&#30340;&#36827;&#31243;id</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">time_t</span> <span class="org-variable-name">msg_stime</span>;             <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#19968;&#27425;&#22312;&#35813;&#38431;&#21015;&#19978;&#35843;&#29992;msgsnd()&#30340;&#26102;&#38388;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">time_t</span> <span class="org-variable-name">msg_rtime</span>;             <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#19968;&#27425;&#22312;&#35813;&#38431;&#21015;&#19978;&#35843;&#29992;msgrcv()&#30340;&#26102;&#38388;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">time_t</span> <span class="org-variable-name">msg_ctime</span>;             <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#19968;&#27425;&#22312;&#35813;&#38431;&#21015;&#21457;&#29983;&#21464;&#21270;&#30340;&#20107;&#20214;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20854;&#20182;&#32467;&#26500;&#25104;&#21592;</span><span class="org-comment-delimiter"> */</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d4c10e" class="outline-4">
<h4 id="org0d4c10e"><span class="section-number-4">3.2.2</span> 操作消息队列</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
msgctl函数对消息队列执行队中操作
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/msg.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">msgctl</span>(<span class="org-type">int</span> <span class="org-variable-name">queueid</span>,<span class="org-type">int</span> <span class="org-variable-name">cmd</span>,<span class="org-keyword">struct</span> <span class="org-type">msgid_ds</span>* <span class="org-variable-name">buf</span>);
</pre>
</div>
<p>
其中cmd参数说明了对queueid指定的队列要执行的命令:
</p>
<ul class="org-ul">
<li><p>
IPC_SET
</p>

<p>
按buf结构中的值,设置与消息队列msqid_ds结构中的下列四个字段:
</p>

<ul class="org-ul">
<li>msg_perm.uid</li>

<li>msg_perm.gid</li>

<li>msg_perm.mode</li>

<li>msg_qbytes</li>
</ul>

<p>
执行该命令的进程,其有效用户ID必须等于msg_perm.cuid或msg_perm.uid或超级用户.
</p>

<p>
只有超级用户才能增加msg_qbyes的值
</p></li>

<li><p>
IPC_RMID
</p>

<p>
删除消息队列中的所有消息.
</p>

<p>
执行该命令的进程,其有效用户ID必须等于msg_perm.cuid或msg_perm.uid或超级用户.
</p></li>

<li><p>
IPC_STAT 
</p>

<p>
取此消息队列的msgid_ds结构,并放在buf所指向的结构中
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/msg.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/ipc.h&gt;</span>

<span class="org-type">void</span> <span class="org-function-name">show_queue_ds</span>(<span class="org-keyword">const</span> <span class="org-keyword">struct</span> <span class="org-type">msqid_ds</span>* <span class="org-variable-name">queue_ds</span>)
{
  printf(<span class="org-string">"msg_qnum=%d\n"</span>,queue_ds-&gt;msg_qnum);
  printf(<span class="org-string">"msg_qbytes=%d\n"</span>,queue_ds-&gt;msg_qbytes);
  printf(<span class="org-string">"msg_lspid=%d\n"</span>,queue_ds-&gt;msg_lspid);
  printf(<span class="org-string">"msg_lrpid=%d\n"</span>,queue_ds-&gt;msg_lrpid);

}
<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span> *<span class="org-variable-name">argv</span>[])
{
  <span class="org-type">int</span> <span class="org-variable-name">queueid</span> = msgget(IPC_PRIVATE,IPC_CREAT);
  <span class="org-keyword">struct</span> <span class="org-type">msqid_ds</span> <span class="org-variable-name">queue_ds</span>;
  msgctl(queueid,IPC_STAT,&amp;queue_ds);
  show_queue_ds(&amp;queue_ds);
  <span class="org-keyword">return</span> 0;
}

</pre>
</div>

<p>
msg_qnum=1630404681
msg_qbytes=1627419888
msg_lspid=1628099819
msg_lrpid=192
</p></li>
</ul>
</div>
</div>
