APUE/进程间通讯.org
*** 收发消息
msgsnd将新消息添加到队列尾端.
#+BEGIN_SRC C
  #include <sys/msg.h>

  /* 参数flag可以为0或IPC_NOWAIT. */
  int msgsnd(int msqid,const msgbuf* ptr,size_t nbytes,int flag);

  struct msgbuf
  {
    long mtype;                   /* 消息类型 */
    char mtext[TEXTSIZE];                /* 信息数据,TEXTSIZE需要比msgsnd中的参数nbytes大 */
  }
#+END_SRC
默认情况下,若消息队列已满,msgsnd函数会阻塞直到有空间要发送,或该队列被删除(返回EIDRM),或捕捉到一个信号,从信号捕捉函数返回(返回EINTR)
但若参数flag设置为IPC_NOWAIT,则msgsnd会立即出错返回EAGAIN.

msgrcv用于从队列中取消息.
#+BEGIN_SRC C
  #include <sys/msg.h>

  /* 成功返回消息的数据部分的长度,出错返回-1 */
  ssize_t msgrcv(int msqid,msgbuf* ptr,size_t nbytes,log type,int flag);
#+END_SRC
参数type指明了我们想获得哪种类型的消息
| type == 0 | 返回队列中的第一个消息               |
| type > 0  | 返回队列中消息类型为type的第一个消息 |
| type < 0  | 返回队列中消息类型<=type绝对值的消息,类型值最小的消息优先(可作为优先级来用) |

参数flag控制了msgrcv的行为
| flag的值    | 说明                                                                |
|-------------+---------------------------------------------------------------------|
| MSG_NOERROR | 若消息大于nbytes,则消息被截断,否则会出错返回E2BIG(消息仍留在队列中) |
| IPC_NOWAIT  | 操作不阻塞,若找不到指定类型的消息,则返回-1,errno设置为ENOMSG        |
|             |                                                                     |
** 信号量集合
信号量是一个计数器,用于标明多进程间共享资源的剩余数量.

每个信号量集合由一个无名结构体表示
#+BEGIN_SRC C
  struct {
    unsigned short semval;        /* 信号量的值 */
    pid_t sempid;                 /* 上次操作该信号量的进程id */
    unsigned short semncnt;       /* 等待semval>curval的进程数 */
    unsigned short semzcnt;       /* 等待semval == 0的进程数 */
    /* 可能还有其他成员 */
  };
#+END_SRC

*** 新建/获取信号量集合
#+BEGIN_SRC C
  #include <sys/sem.h>

  int semget(key_t key,int sem_num,int flag);
#+END_SRC
+ 若创建新信号量集合,则参数sem_num表示该信号量集合中包含了多少个信号量(编号从0到max_num-1)
+ 若获取一个现存的信号量,则将sem_num设置为0

