blog/2015/06/04/进程间通讯/index.html

<div id="outline-container-org67332a6" class="outline-4">
<h4 id="org67332a6"><span class="section-number-4">3.2.3</span> 收发消息</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
msgsnd将新消息添加到队列尾端.
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/msg.h&gt;</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#21442;&#25968;flag&#21487;&#20197;&#20026;0&#25110;IPC_NOWAIT.</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">int</span> <span class="org-function-name">msgsnd</span>(<span class="org-type">int</span> <span class="org-variable-name">msqid</span>,<span class="org-keyword">const</span> <span class="org-type">msgbuf</span>* <span class="org-variable-name">ptr</span>,<span class="org-type">size_t</span> <span class="org-variable-name">nbytes</span>,<span class="org-type">int</span> <span class="org-variable-name">flag</span>);

<span class="org-keyword">struct</span> <span class="org-type">msgbuf</span>
{
  <span class="org-type">long</span> <span class="org-variable-name">mtype</span>;                   <span class="org-comment-delimiter">/* </span><span class="org-comment">&#28040;&#24687;&#31867;&#22411;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">char</span> <span class="org-variable-name">mtext</span>[TEXTSIZE];                <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20449;&#24687;&#25968;&#25454;,TEXTSIZE&#38656;&#35201;&#27604;msgsnd&#20013;&#30340;&#21442;&#25968;nbytes&#22823;</span><span class="org-comment-delimiter"> */</span>
}
</pre>
</div>
<p>
默认情况下,若消息队列已满,msgsnd函数会阻塞直到有空间要发送,或该队列被删除(返回EIDRM),或捕捉到一个信号,从信号捕捉函数返回(返回EINTR)
但若参数flag设置为IPC_NOWAIT,则msgsnd会立即出错返回EAGAIN.
</p>

<p>
msgrcv用于从队列中取消息.
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/msg.h&gt;</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#25104;&#21151;&#36820;&#22238;&#28040;&#24687;&#30340;&#25968;&#25454;&#37096;&#20998;&#30340;&#38271;&#24230;,&#20986;&#38169;&#36820;&#22238;-1</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">ssize_t</span> <span class="org-function-name">msgrcv</span>(<span class="org-type">int</span> <span class="org-variable-name">msqid</span>,<span class="org-type">msgbuf</span>* <span class="org-variable-name">ptr</span>,<span class="org-type">size_t</span> <span class="org-variable-name">nbytes</span>,<span class="org-type">log</span> <span class="org-variable-name">type</span>,<span class="org-type">int</span> <span class="org-variable-name">flag</span>);
</pre>
</div>
<p>
参数type指明了我们想获得哪种类型的消息
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">type == 0</td>
<td class="org-left">返回队列中的第一个消息</td>
</tr>

<tr>
<td class="org-left">type &gt; 0</td>
<td class="org-left">返回队列中消息类型为type的第一个消息</td>
</tr>

<tr>
<td class="org-left">type &lt; 0</td>
<td class="org-left">返回队列中消息类型&lt;=type绝对值的消息,类型值最小的消息优先(可作为优先级来用)</td>
</tr>
</tbody>
</table>

<p>
参数flag控制了msgrcv的行为
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">flag的值</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MSG_NOERROR</td>
<td class="org-left">若消息大于nbytes,则消息被截断,否则会出错返回E2BIG(消息仍留在队列中)</td>
</tr>

<tr>
<td class="org-left">IPC_NOWAIT</td>
<td class="org-left">操作不阻塞,若找不到指定类型的消息,则返回-1,errno设置为ENOMSG</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgd28bb7c" class="outline-3">
<h3 id="orgd28bb7c"><span class="section-number-3">3.3</span> 信号量集合</h3>
<div class="outline-text-3" id="text-3-3">
<p>
信号量是一个计数器,用于标明多进程间共享资源的剩余数量.
</p>

<p>
每个信号量集合由一个无名结构体表示
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-keyword">struct</span> {
  <span class="org-type">unsigned</span> <span class="org-type">short</span> <span class="org-variable-name">semval</span>;        <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20449;&#21495;&#37327;&#30340;&#20540;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">pid_t</span> <span class="org-variable-name">sempid</span>;                 <span class="org-comment-delimiter">/* </span><span class="org-comment">&#19978;&#27425;&#25805;&#20316;&#35813;&#20449;&#21495;&#37327;&#30340;&#36827;&#31243;id</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">unsigned</span> <span class="org-type">short</span> <span class="org-variable-name">semncnt</span>;       <span class="org-comment-delimiter">/* </span><span class="org-comment">&#31561;&#24453;semval&gt;curval&#30340;&#36827;&#31243;&#25968;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">unsigned</span> <span class="org-type">short</span> <span class="org-variable-name">semzcnt</span>;       <span class="org-comment-delimiter">/* </span><span class="org-comment">&#31561;&#24453;semval == 0&#30340;&#36827;&#31243;&#25968;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">&#21487;&#33021;&#36824;&#26377;&#20854;&#20182;&#25104;&#21592;</span><span class="org-comment-delimiter"> */</span>
};
</pre>
</div>
</div>

<div id="outline-container-org236f5f2" class="outline-4">
<h4 id="org236f5f2"><span class="section-number-4">3.3.1</span> 新建/获取信号量集合</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/sem.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">semget</span>(<span class="org-type">key_t</span> <span class="org-variable-name">key</span>,<span class="org-type">int</span> <span class="org-variable-name">sem_num</span>,<span class="org-type">int</span> <span class="org-variable-name">flag</span>);
</pre>
</div>
<ul class="org-ul">
<li>若创建新信号量集合,则参数sem_num表示该信号量集合中包含了多少个信号量(编号从0到max_num-1)</li>
<li>若获取一个现存的信号量,则将sem_num设置为0</li>
</ul>
</div>
</div>
