APUE/进程间通讯.org
*** 操作信号量
+ semctl函数
  #+BEGIN_SRC C
    #include <sys/sem.h>

    /* 返回值的意义根据cmd的不同而不同 */
    int semctl(int semid,int semnum,int cmd);
    int semctl(int semid,int semnum,int cmd,union semun arg);

    union semnum{
      int val;                      /* cmd为SETVAL时 */
      struct semid_ds* buf;         /* cmd为IPC_STAT或IPC_SET时 */
      unsigned short* array;        /* cmd为GETALL或SETALL时 */
    };

    struct semid_ds
    {
      struct ipc_perm sem_perm;   /* ipc权限 */
      unsigned short sem_nsems;   /* 信号量集合中信号量的个数 */
      time_t sem_otime;           /* 最后执行semop()的时间 */
      time_t sem_ctime;           /* 最后改变semid_ds结构体的时间 */
      /* 其他成员 */
    };
  #+END_SRC
  cmd参数说明
  | IPC_STAT | 取当前信号量集合的semid_ds结构,存放在arg.buf中                                                                                                           |
  | IPC_SET  | 根据arg.buf中的值,更新该信号量集合的sem_perm.uid,sem_perm.gid或sem_perm.mode. 执行该函数的进程其有效用户ID必须为sem_perm.cuid/sem_perm.uid或超级用户权限 |
  | IPC_RMID | 立即删除该信号量集合.执行该函数的进程其有效用户ID必须为sem_perm.cuid/sem_perm.uid或超级用户权限                                                          |
  | GETVAL   | 返回信号量集合中第semnum个信号量的值                                                                                                                     |
  | SETVAL   | 设置信号集合中第semnum个信号量的值,该值由arg.val指定                                                                                                     |
  | GETPID   | 返回上次操作信号量的进程PID                                                                                                                              |
  | GETNCNT  | 返回信号量集合中第semnum个信号量的semncnt的值                                                                                                            |
  | GETZCNT  | 返回信号量集合中第semnum个信号量的semzcnt的值                                                                                                            |
  | GETALL   | 获取信号量集合中所有信号量的值,并将它们存放在arg.array中                                                                                                |
  | SETALL   | 根据arg.array中的值设置信号量集合中所有信号量的值                                                                                                                            |

+ semop函数
  semop提供了操作信号量集合上各信号量值的原子操作
  #+BEGIN_SRC C
    #include <sys/sem.h>

    /* 成功返回0,失败返回-1 */
    int semop(int semid,struct sembuf semop_array[],size_t npos);

    struct sembuf
    {
      unsigned short sem_num;       /* 指明操作的是信号量集合中的第几个信号量 */
      short sem_op;                 /* 是何种操作,可以为负数,0或正数 */
      short sem_flg;                /* IPC_NOWAIT,SEM_UNDO */
    };
  #+END_SRC
+ 参数npos指明了只按照semop_array中操作的数量.
+ sem_op的值说明:
  | sem_op的值 | 说明                                                        |
  |------------+-------------------------------------------------------------|
  |         >0 | *表示资源要释放资源*. 增加信号量sem_op的值 |
  |         <0 | *表示进程要占用资源*. 减少信号量值, *若信号量不够减,则操作被阻塞* |
  |          0 | 表示进程等待信号量变为0. 不为0则该操作被阻塞                                    |
+ sem_flg的值说明
  | sem_flg的值 | 说明                                   |
  |-------------+----------------------------------------|
  | IPC_NOWAIT  | 不阻塞,若操作无法完成,则直接返回EAGAIN |
  | SEM_UNDO    | 修改进程的 *信号量调整值*. 进程在退出时,内核会根据该调整值释放资源. *推荐使用* |

** 共享存储器
共享存储器运行多个进程共享同一块存储区,由于数据不需要在进程间复制,所以这是最快的一种IPC. 

由于不同进程要对同一块存储区操作,因此通常会使用记录锁或信号量来实现对共享存储区访问的同步.

内核为每个共享存储段设置了一个shmid_ds结构
#+BEGIN_SRC C
  struct shmid_ds{
    struct ipc_perm shm_perm;     /* IPC权限说明 */
    size_t shm_segsz;             /* 共享存储的大小 */
    pid_t shm_lpid;               /* 最后执行shmop()的进程ID */
    pid_t shm_cpid;               /* 创建该共享存储的进程ID */
    shmatt_t shm_nattch;          /* 当前attach到该共享内存的数量 */
    time_t shm_atime;             /* 最后一次attach的时间 */
    time_t shm_dtime;             /* 最后一次detach的时间 */
    time_t shm_ctime;             /* 最后一次更改shmid_ds结构的时间 */
    /* 其他成员 */
  }
#+END_SRC

