blog/2015/06/04/进程间通讯/index.html

<div id="outline-container-org2c07784" class="outline-4">
<h4 id="org2c07784"><span class="section-number-4">3.3.2</span> 操作信号量</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li><p>
semctl函数
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/sem.h&gt;</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#36820;&#22238;&#20540;&#30340;&#24847;&#20041;&#26681;&#25454;cmd&#30340;&#19981;&#21516;&#32780;&#19981;&#21516;</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">int</span> <span class="org-function-name">semctl</span>(<span class="org-type">int</span> <span class="org-variable-name">semid</span>,<span class="org-type">int</span> <span class="org-variable-name">semnum</span>,<span class="org-type">int</span> <span class="org-variable-name">cmd</span>);
<span class="org-type">int</span> <span class="org-function-name">semctl</span>(<span class="org-type">int</span> <span class="org-variable-name">semid</span>,<span class="org-type">int</span> <span class="org-variable-name">semnum</span>,<span class="org-type">int</span> <span class="org-variable-name">cmd</span>,<span class="org-keyword">union</span> <span class="org-type">semun</span> <span class="org-variable-name">arg</span>);

<span class="org-keyword">union</span> <span class="org-type">semnum</span>{
  <span class="org-type">int</span> <span class="org-variable-name">val</span>;                      <span class="org-comment-delimiter">/* </span><span class="org-comment">cmd&#20026;SETVAL&#26102;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-keyword">struct</span> <span class="org-type">semid_ds</span>* <span class="org-variable-name">buf</span>;         <span class="org-comment-delimiter">/* </span><span class="org-comment">cmd&#20026;IPC_STAT&#25110;IPC_SET&#26102;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">unsigned</span> <span class="org-type">short</span>* <span class="org-variable-name">array</span>;        <span class="org-comment-delimiter">/* </span><span class="org-comment">cmd&#20026;GETALL&#25110;SETALL&#26102;</span><span class="org-comment-delimiter"> */</span>
};

<span class="org-keyword">struct</span> <span class="org-type">semid_ds</span>
{
  <span class="org-keyword">struct</span> <span class="org-type">ipc_perm</span> <span class="org-variable-name">sem_perm</span>;   <span class="org-comment-delimiter">/* </span><span class="org-comment">ipc&#26435;&#38480;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">unsigned</span> <span class="org-type">short</span> <span class="org-variable-name">sem_nsems</span>;   <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20449;&#21495;&#37327;&#38598;&#21512;&#20013;&#20449;&#21495;&#37327;&#30340;&#20010;&#25968;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">time_t</span> <span class="org-variable-name">sem_otime</span>;           <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#25191;&#34892;semop()&#30340;&#26102;&#38388;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">time_t</span> <span class="org-variable-name">sem_ctime</span>;           <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#25913;&#21464;semid_ds&#32467;&#26500;&#20307;&#30340;&#26102;&#38388;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20854;&#20182;&#25104;&#21592;</span><span class="org-comment-delimiter"> */</span>
};
</pre>
</div>
<p>
cmd参数说明
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">IPC_STAT</td>
<td class="org-left">取当前信号量集合的semid_ds结构,存放在arg.buf中</td>
</tr>

<tr>
<td class="org-left">IPC_SET</td>
<td class="org-left">根据arg.buf中的值,更新该信号量集合的sem_perm.uid,sem_perm.gid或sem_perm.mode. 执行该函数的进程其有效用户ID必须为sem_perm.cuid/sem_perm.uid或超级用户权限</td>
</tr>

<tr>
<td class="org-left">IPC_RMID</td>
<td class="org-left">立即删除该信号量集合.执行该函数的进程其有效用户ID必须为sem_perm.cuid/sem_perm.uid或超级用户权限</td>
</tr>

<tr>
<td class="org-left">GETVAL</td>
<td class="org-left">返回信号量集合中第semnum个信号量的值</td>
</tr>

<tr>
<td class="org-left">SETVAL</td>
<td class="org-left">设置信号集合中第semnum个信号量的值,该值由arg.val指定</td>
</tr>

<tr>
<td class="org-left">GETPID</td>
<td class="org-left">返回上次操作信号量的进程PID</td>
</tr>

<tr>
<td class="org-left">GETNCNT</td>
<td class="org-left">返回信号量集合中第semnum个信号量的semncnt的值</td>
</tr>

<tr>
<td class="org-left">GETZCNT</td>
<td class="org-left">返回信号量集合中第semnum个信号量的semzcnt的值</td>
</tr>

<tr>
<td class="org-left">GETALL</td>
<td class="org-left">获取信号量集合中所有信号量的值,并将它们存放在arg.array中</td>
</tr>

<tr>
<td class="org-left">SETALL</td>
<td class="org-left">根据arg.array中的值设置信号量集合中所有信号量的值</td>
</tr>
</tbody>
</table></li>

<li><p>
semop函数
semop提供了操作信号量集合上各信号量值的原子操作
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/sem.h&gt;</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#25104;&#21151;&#36820;&#22238;0,&#22833;&#36133;&#36820;&#22238;-1</span><span class="org-comment-delimiter"> */</span>
<span class="org-type">int</span> <span class="org-function-name">semop</span>(<span class="org-type">int</span> <span class="org-variable-name">semid</span>,<span class="org-keyword">struct</span> <span class="org-type">sembuf</span> <span class="org-variable-name">semop_array</span>[],<span class="org-type">size_t</span> <span class="org-variable-name">npos</span>);

<span class="org-keyword">struct</span> <span class="org-type">sembuf</span>
{
  <span class="org-type">unsigned</span> <span class="org-type">short</span> <span class="org-variable-name">sem_num</span>;       <span class="org-comment-delimiter">/* </span><span class="org-comment">&#25351;&#26126;&#25805;&#20316;&#30340;&#26159;&#20449;&#21495;&#37327;&#38598;&#21512;&#20013;&#30340;&#31532;&#20960;&#20010;&#20449;&#21495;&#37327;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">short</span> <span class="org-variable-name">sem_op</span>;                 <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26159;&#20309;&#31181;&#25805;&#20316;,&#21487;&#20197;&#20026;&#36127;&#25968;,0&#25110;&#27491;&#25968;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">short</span> <span class="org-variable-name">sem_flg</span>;                <span class="org-comment-delimiter">/* </span><span class="org-comment">IPC_NOWAIT,SEM_UNDO</span><span class="org-comment-delimiter"> */</span>
};
</pre>
</div></li>
<li>参数npos指明了只按照semop_array中操作的数量.</li>
<li><p>
sem_op的值说明:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sem_op的值</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&gt;0</td>
<td class="org-left"><b>表示资源要释放资源</b>. 增加信号量sem_op的值</td>
</tr>

<tr>
<td class="org-left">&lt;0</td>
<td class="org-left"><b>表示进程要占用资源</b>. 减少信号量值, <b>若信号量不够减,则操作被阻塞</b></td>
</tr>

<tr>
<td class="org-left">0</td>
<td class="org-left">表示进程等待信号量变为0. 不为0则该操作被阻塞</td>
</tr>
</tbody>
</table></li>
<li><p>
sem_flg的值说明
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sem_flg的值</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">IPC_NOWAIT</td>
<td class="org-left">不阻塞,若操作无法完成,则直接返回EAGAIN</td>
</tr>

<tr>
<td class="org-left">SEM_UNDO</td>
<td class="org-left">修改进程的 <b>信号量调整值</b>. 进程在退出时,内核会根据该调整值释放资源. <b>推荐使用</b></td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2c7437f" class="outline-3">
<h3 id="org2c7437f"><span class="section-number-3">3.4</span> 共享存储器</h3>
<div class="outline-text-3" id="text-3-4">
<p>
共享存储器运行多个进程共享同一块存储区,由于数据不需要在进程间复制,所以这是最快的一种IPC. 
</p>

<p>
由于不同进程要对同一块存储区操作,因此通常会使用记录锁或信号量来实现对共享存储区访问的同步.
</p>

<p>
内核为每个共享存储段设置了一个shmid_ds结构
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-keyword">struct</span> <span class="org-type">shmid_ds</span>{
  <span class="org-keyword">struct</span> <span class="org-type">ipc_perm</span> <span class="org-variable-name">shm_perm</span>;     <span class="org-comment-delimiter">/* </span><span class="org-comment">IPC&#26435;&#38480;&#35828;&#26126;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">size_t</span> <span class="org-variable-name">shm_segsz</span>;             <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20849;&#20139;&#23384;&#20648;&#30340;&#22823;&#23567;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">pid_t</span> <span class="org-variable-name">shm_lpid</span>;               <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#25191;&#34892;shmop()&#30340;&#36827;&#31243;ID</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">pid_t</span> <span class="org-variable-name">shm_cpid</span>;               <span class="org-comment-delimiter">/* </span><span class="org-comment">&#21019;&#24314;&#35813;&#20849;&#20139;&#23384;&#20648;&#30340;&#36827;&#31243;ID</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">shmatt_t</span> <span class="org-variable-name">shm_nattch</span>;          <span class="org-comment-delimiter">/* </span><span class="org-comment">&#24403;&#21069;attach&#21040;&#35813;&#20849;&#20139;&#20869;&#23384;&#30340;&#25968;&#37327;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">time_t</span> <span class="org-variable-name">shm_atime</span>;             <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#19968;&#27425;attach&#30340;&#26102;&#38388;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">time_t</span> <span class="org-variable-name">shm_dtime</span>;             <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#19968;&#27425;detach&#30340;&#26102;&#38388;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-type">time_t</span> <span class="org-variable-name">shm_ctime</span>;             <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26368;&#21518;&#19968;&#27425;&#26356;&#25913;shmid_ds&#32467;&#26500;&#30340;&#26102;&#38388;</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">&#20854;&#20182;&#25104;&#21592;</span><span class="org-comment-delimiter"> */</span>
}
</pre>
</div>
</div>
